---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId
source: html/2f992473-1cdd-0654-3207-1f91102ee3e1.htm
---
# MEPNetworkSegmentId Methods

Verifies if this is a valid segment id.